# Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа. На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено

# магическо число. Ако няма нито една комбинация отговаряща на условието се отпечатва съобщение, че не е намерено.

# Вход

# Входът се чете от конзолата и се състои от три реда:

# · Първи ред – начало на интервала – цяло число в интервала [1...999]

# · Втори ред – край на интервала – цяло число в интервала [по-голямо от първото число...1000]

# · Трети ред – магическото число – цяло число в интервала [1...10000]

# Изход

# На конзолата трябва да се отпечата един ред, според резултата:

# · Ако е намерена комбинация чиито сбор на числата е равен на магическото число

# o "Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"

# · Ако не е намерена комбинация отговаряща на условието

# o "{броят на всички комбинации} combinations - neither equals {магическото число}" 

n1 = int(input())
n2 = int(input())
num = int(input())
counter = 0
flag = False

for x in range (n1,n2+1):
    for y in range (n1,n2+1):
        counter += 1
        if x + y == num:
            print(f'Combination N:{counter} ({x} + {y} = {num})')
            flag = True
            break
    if flag:
        break
else:
    print(f'{counter} combinations - neither equals {num}')
    