# Напишете програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:

# · На всеки четен етаж има само офиси;

# · На всеки нечетен етаж има само апартаменти;

# · Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0;

# · Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0;

# · На последният етаж винаги има апартаменти и те са по-големи от останалите, затова пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!

# От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж. 

floors = int(input())
rooms_per_floors = int(input())

for floor in reversed(range(1,floors+1)):
    
    room_type = "A" if floor % 2 else "O"

    if floor == floors:
        room_type = 'L'
    
    for room in range(rooms_per_floors):
        room_name = f"{room_type}{floor}{room}"
        print(room_name, end=' ')
    
    print()