# Учебната година вече е започнала и отговорничката на 10Б клас - Ани трябва да купи определен брой пакетчета с химикали, пакетчета с маркери, както и препарат за почистване на дъска. Тя е редовна клиентка на една книжарница, затова има намаление за нея, което представлява някакъв процент от общата сума. Напишете програма, която изчислява колко пари ще трябва да събере Ани, за да плати сметката, като имате предвид следния ценоразпис:

# • Пакет химикали - 5.80 лв.

# • Пакет маркери - 7.20 лв.

# • Препарат - 1.20 лв (за литър)

# Вход

# От конзолата се четат 4 числа:

# · Брой пакети химикали - цяло число в интервала [0...100]

# · Брой пакети маркери - цяло число в интервала [0...100]

# · Литри препарат за почистване на дъска - цяло число в интервала [0…50]

# · Процент намаление - цяло число в интервала [0...100]

price_pens = 5.80
price_markers = 7.20
price_liters = 1.20

pens = int(input())

markers = int(input())

liters = int(input())

discount = int(input()) / 100

package_pens = pens * price_pens
package_markers = markers * price_markers
package_liters = liters * price_liters

total_price = package_pens + package_markers + package_liters
discounted_price = total_price-(total_price*discount)

print(discounted_price)