# Напишете програма, която чете цяло число n, въведено от потребителя, и отпечатва пирамида от числа като в примерите:

# вход изход вход изход вход изход вход изход

# 7 1 2 3 4 5 6 7 10 1 2 3 4 5 6 7 8 9 10 12 1 2 3 4 5 6 7 8 9 10 11 12 15 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15

flag = False
num = 1
n = int(input())

for row in range(1,n+1):
    for col in range(1,row+1):
        if num > n:
            flag = True
            break

        print(num, end=' ')
        num += 1
    print()
    if flag:
        break