# Напишете програма, която чете от конзолата две шестцифрени цели числа. Винаги първото въведено число ще бъде по-малко от второто. На конзолата да се отпечатат на 1, ред разделени с интервал, всички числа, които се намират между двете, прочетени от конзолата числа и отговарят на условието сумата от цифрите на четни и нечетни позиции да са равни. Ако няма числа, отговарящи на условието на конзолата не се извежда резултат. 

n1 = int(input())
n2 = int(input())

for i in range(n1,n2+1):
    curr_n = str(i)
    
    even_sum = 0
    odd_sum = 0
    
    for j in range (0,len(curr_n)):
        digit = int(curr_n[j])

        if j % 2 == 0:
            even_sum += digit
        else:
            odd_sum += digit
    
    if even_sum == odd_sum:
        print(curr_n, end=' ')