# Курсът "Train the trainers" е към края си и финалното оценяване наближава. Вашата задача е да помогнете на журито, което ще оценява презентациите, като напишете програма, в която да изчислява средната оценка от представянето на всяка една презентация от даден студент, а накрая - средния успех от всички тях.

# От конзолата на първият ред се прочита броят на хората в журито n - цяло число.

# След това на отделен ред се прочита името на презентацията – текст.

# За всяка една презентация на нов ред се четат n - на брой оценки - реално число.

# След изчисляване на средната оценка за конкретна презентация, на конзолата се печата:

# "{името на презентацията} - {средна оценка}."

# След получаване на команда "Finish", на конзолата се печата "Student's final assessment is {среден успех от всички презентации}." и програмата приключва.

# Всички оценки трябва да бъдат форматирани до втория знак след десетичната запетая.

n = int(input())

npt = input()

counter = 0
sum_all_grades = 0
while npt != 'Finish': 
    present_name = npt

    sum_curr_grade = 0
    for i in range(1, n + 1):
        curr_grade = float(input())
        counter += 1
        sum_curr_grade += curr_grade
        sum_all_grades += curr_grade

    avg_curr_grade = sum_curr_grade / n
    print(f"{present_name} - {avg_curr_grade:.2f}.")

    npt = input()

avg_all_grades = sum_all_grades / counter
print(f"Student's final assessment is {avg_all_grades:.2f}.")